---
kind: method
id: M:Autodesk.Revit.UI.UIDocument.Dispose
source: html/47d89c68-0225-a534-5ace-b252cf90bfd7.htm
---
# Autodesk.Revit.UI.UIDocument.Dispose Method

Releases all resources used by the UIDocument

## Syntax (C#)
```csharp
public void Dispose()
```